Repository: Placito/My_Portfolio
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: pt

source: All fields are required!
pt: Todos os campos são necessários

source: Message sent successfully!
pt: Mensagem enviada com sucesso!

source: An error occurred while sending the message. Please try again later.
pt: Um erro ocorreu durante o envio da mensagem. Por favor tente outra vez.

source: Invalid request method.
pt: Método de solicitação inválido.

source: Home
pt: Início

source: About
pt: Sobre

source: Skills
pt: Habilidades

source: Curriculum
pt: Currículo

source: Portfolio
pt: Portfólio

source: Contact
pt: Contacto

source: Select one language
pt: Selecciona um idioma

source: English
pt: Inglês

source: Portuguese
pt: Português

source: Subscribe
pt: Subscreva

source: By clicking this button you are allowing us to send you notifications from this website.
pt: Ao clicar neste botão permite-nos enviar notificações deste site.

source: Privacy Policy
pt: Politíca de privacidade

source: Terms
pt: Termos

source: Full Stack Developer
pt: Desenvolvedora Full Stack

source: Proactive Full Stack Developer. I started my journey with a degree in Human Biology, which later led me to discover my new abilities with a Design course, which sparked a passion for me in the programming field. I have a natural aptitude for the front-end but a passion for discovering how things work behind the scenes, which led me to combine these two areas.
pt: Proativa desenvolvedora de Full Stack. Comecei a minha jornada com uma licenciatura em Biologia Humana, que mais tarde me levou a descobrir novas habilidades com um curso de Design, que despertou em mim uma nova paixão pela área de programação. Eu tenho uma aptidão natural para o front-end mas uma paixão por descobrir como as coisas funcionam nos bastidores, o que me levou a combinar estas duas áreas.

source: Is an entry-level position in the field of software development, responsible for working on both the front-end and back-end portions of web applications.
pt: É uma posição inicial na área de desenvolvimento de software, onde estou responsável por trabalhar nas partes front-end e back-end de aplicações web.

source: Date of birth:
pt: Data de nascimento

source: December 24, 1989
pt: 24 de Dezembro de 1989

source: Age:
pt: Idade:

source: City:
pt: Cidade:

source: Country:
pt: País:

source: Hobby:
pt: Passatempo:

source: Hiking
pt: Caminhada

source: Work:
pt: Trabalho:

source: Experience:
pt: Experiência

source: Download my CV
pt: Download do meu CV

source: Throughout my time as a professional I have acquired some technical and soft skills, most of them are here, according to the percentage of knowledge I believe I have in each of them.
pt: Ao longo do meu percurso como profissional adquiri alguns conhecimentos técnicos e habilidades interpessoais, a maioria delas está aqui, de acordo com a percentagem de conhecimento que acredito ter em cada uma delas.

source: Communication
pt: Educação

source: Full-Stack Software Developer
pt: Desenvolvedora de software Full-Stack

source: Online, Spain
pt: Online, Espanha

source: Hands-on program to become a Full-Stack Software Developer, focusing on mastering both frontend and backend technologies.
pt: Programa prático para se tornar um desenvolvedor Full-Stack de software, com foco em dominar as tecnologias de front-end e back-end.

source: Development of multimedia products
pt: Desenvolvimento de produtos multimédia

source: Specialized in multimedia product development, gaining practical skills in the latest digital design and media production technologies.
pt: Especialização em desenvolvimento de produtos multimídia, adquirindo habilidades práticas nas mais recentes tecnologias de design digital e produção de mídia.

source: Degree in Human Biology
pt: Licenciatura em Biologia Humana

source: Completed a comprehensive study in Human Biology, acquiring a strong foundation in biological sciences and their application to human health and disease.
pt: Compreende um estudo abrangente em Biologia Humana, adquirindo um forte conhecimento em fundamentos nas ciências biológicas e na sua aplicação à saúde humana e doenças.

source: Professional
pt: Profissional

source: Full-Stack Developer
pt: Desenvolvedora Full-Stack

source: The moment
pt: No momento

source: Develop user-friendly web interfaces using HTML, CSS, and JavaScript. Participate in code reviews and provide constructive feedback. Troubleshoot, debug, and resolve issues in both frontend and backend components.
pt: Desenvolver interfaces web fáceis de usar usando HTML, CSS e JavaScript.Participar em revisões de código e fornecer feedback construtivo.Solucionar, encontrar e resolver problemas em componentes tanto no front-end quanto no back-end.

source: Graphic designer
pt: Designer gráfica

source: Assisting in the management of the company's website development, like, taking photographs and designing them, updating its content in the website's admin dashboard, and reporting problems that would appear.
pt: Auxiliar na gestão do desenvolvimento do site da empresa, como, tirar fotografias e desenhá-las, atualizando seu conteúdo no painel de administração do site e relatórios de problemas que apareceriam.

source: Digital animation intern
pt: Estagiária em animação digital

source: Role as creator of content, animations, web design and learning
pt: Papel de criadora de conteúdo, animações, design web e aprendizagem

source: Develop during a programming bootcamp, an e-commerce platform where users can browse, review, purchase.
pt: Desenvolvido durante um bootcamp de programação, é uma plataforma de e-commerce onde os utilizadores podem ​​navegar, comentar e comprar.

source: Is an application to assist in task management, for internal roles.
pt: É uma aplicação para assitir na gestão de tarefas internas.

source: My design portfolio
pt: O meu portfólio de design

source: Work developed in my CET, using techniques like, Adobe Illustrator, Adobe Photoshop, Adobe After Effects, Adobe Premier, Photography and 3ds Max. The language I selected to present my work was Portuguese.
pt: Trabalho desenvolvido no meu CET, utilizando técnicas como, Adobe Illustrator, Adobe Photoshop, Adobe After Effects, Adobe Premier, Fotografia e 3ds Max. O idioma que selecionei para apresentar o meu trabalho foi o português.

source: Previous
pt: Anterior

source: Next
pt: Seguinte

source: Location:
pt: Localização:

source: Name:
pt: Nome:

source: Write your name
pt: Escreva o seu nome

source: Write your email
pt: Escreva o seu email

source: Message:
pt: Mensagem:

source: Write your message
pt: Escreva a sua mensagem

source: Send
pt: Enviar

source: Introduction
pt: Introdução

source: Your privacy is important to us. This privacy policy explains what information we collect, how we use it, and your rights in relation to it.
pt: A Sua privacidade é importante para nós. Esta política de privacidade explica quais informações que recolhemos e de que forma as usamos e os seus direitos em relação a elas.

source: Information We Collect
pt: Informação que recolhemos

source: We collect information to provide better services to our users. This includes:
pt: Recolhemos informações para oferecer melhores serviços aos nossos utilizadores.

source: IP Addresses:
pt: Endereços IP

source: We track IP addresses to improve the security and performance of our service.
pt: Rastreamos endereços IP para melhorar a segurança e o desempenho do nosso serviço.

source: How We Use Information
pt: Como utilizamos a infoprmação

source: The information we collect is used for:
pt: A informação que recolhemos é usada para:

source: Security
pt: Segurança

source: Monitoring and preventing security threats.
pt: Monitorização e prevenção de ameaças à segurança.

source: Analytics
pt: Análises

source: Understanding usage patterns to improve our service.
pt: Compreender padrões de uso para melhorar nosso serviço.

source: Data Protection
pt: Proteção de dados

source: We implement appropriate technical and organizational measures to protect the information we collect.
pt: Implementamos medidas técnicas e organizacionais apropriadas para proteger as informações que recolhemos.

source: Changes to This Policy
pt: Alterações a esta politíca

source: We may update this privacy policy from time to time. We will notify you of any changes by posting the new privacy policy on this page.
pt: Podemos atualizar esta política de privacidade de tempos em tempos. Notificaremos sobre quaisquer mudanças publicando a nova política de privacidade nesta página.

source: Contact Us
pt: Contacte-nos

source: If you have any questions about these terms, please contact us at
pt: Se tiver alguma dúvida sobre estes termos, entre em contato comnosco através de

source: Back to Home
pt: Voltar ao Início

source: These terms of service govern your use of our application. By using our application, you agree to these terms.
pt: Estes termos de serviço regem o uso da nossa aplicação. Ao usá-la você concorda com estes termos.

source: Use of Data
pt: Uso da informação

source: By using our application, you agree that we can track your IP address and use it for:
pt: Ao usar a nossa aplicação, você concorda que podemos rastrear seu endereço IP e usá-lo para:

source: Security purposes:
pt: Propósitos de segurança

source: To monitor and prevent security threats.
pt: Para monitorar e prevenir ameaças à segurança.

source: Analytics purposes:
pt: Propósitos de análise:

source: To understand usage patterns and improve our service.
pt: Para entender os padrões de uso e melhorar nosso serviço.

source: User Responsibilities
pt: Responsabilidades dos utilizadores

source: Users are responsible for:
pt: Utilizadores são responsáveis por:

source: Ensuring that their use of the service complies with all applicable laws and regulations.
pt: Garantir que o uso do serviço esteja em conformidade com todas as leis aplicáveise regulamentos.

source: Changes to These Terms
pt: Alteração destes termos

source: We may update these terms from time to time. We will notify you of any changes by posting the new terms on this page.
pt: Podemos atualizar estes termos de tempos em tempos. Notificaremos você sobre quaisquer mudanças publicando os novos termos nesta página.

source: {editor}: Editing failed
pt: {editor}: Falha na edição {e}

source: Aborted!
pt: Mostra esta mensagem e saí.

source: (Deprecated) {text}
pt: (Descontínuado) {text}

source: Options
pt: Opções

source: Got unexpected extra argument ({args})
pt: Recebeu um argumento extra inesperado ({args})

source: DeprecationWarning: The command {name!r} is deprecated.
pt: DeprecationWarning: O comando {name!r} foi descontinuado.

source: Commands
pt: Comandos

source: Missing command.
pt: Comando em falta

source: No such command {name!r}.
pt: Não existe o comando {name!r}.

source: Value must be an iterable.
pt: O valor inserido deve ser iterável.

source: Takes {nargs} values but 1 was given.
pt: Aceita {nargs} como valores mas 1 já foi dado.

source: (dynamic)
pt: (dinâmico)

source: default: {default}
pt: padrão: {default}

source: required
pt: necessário

source: %(prog)s, version %(version)s
pt: %(prog)s, versão %(version)s

source: Show the version and exit.
pt: Mostre a versão e saí.

source: Error: {message}
pt: Erro: {message}

source: Try '{command} {option}' for help.
pt: Tente o '{command} {option}' para ajuda.

source: Invalid value: {message}
pt: Valor inválido: {message}

source: Invalid value for {param_hint}: {message}
pt: Valor inválido para {param_hint}: {message}

source: Missing argument
pt: Falta argumento

source: Missing option
pt: Falta opção

source: Missing parameter
pt: Falta parametro

source: Missing {param_type}
pt: Falta {param_type}

source: Missing parameter: {param_name}
pt: Falta parametro: {param_name}

source: No such option: {name}
pt: Esta opção nao existe: {name}

source: Did you mean {possibility}?
pt: Quis dizer {possibility}?

source: unknown error
pt: erro desconhecido

source: Could not open file {filename!r}: {message}
pt: Não consegui abrir o ficheiro {filename!r}: {message}

source: Argument {name!r} takes {nargs} values.
pt: Argumento {name!r} leva {nargs} valores.

source: Option {name!r} does not take a value.
pt: Opção {name!r} não leva esste valor.

source: Option {name!r} requires an argument.
pt: Opção {name!r} necessita de um argumento.

source: Shell completion is not supported for Bash versions older than 4.4.
pt: A conclusão do Shell não é suportada para versões do Bash anteriores a 4.4.

source: Couldn't detect Bash version, shell completion is not supported.
pt: Não foi possível detectar a versão do Bash, a conclusão do shell não é suportada.

source: Repeat for confirmation
pt: Repita para confirmação

source: Error: The value you entered was invalid.
pt: Erro: O valor que inseriu é inválido.

source: Error: {e.message}
pt: Erro: {e.message}

source: Error: The two entered values do not match.
pt: Erro: Os dois valores inseridos não correspondem.

source: Error: invalid input
pt: Erro: input inválido

source: Press any key to continue...
pt: Carrega em qualquer tecla para continuar...

source: {value!r} is not {choice}.
pt: {value!r} não é {choice}.

source: {value!r} does not match the format {format}.
pt: {value!r} não corresponde ao formato {format}.

source: {value!r} is not a valid {number_type}.
pt: {value!r} não é válido {number_type}.

source: {value} is not in the range {range}.
pt: {value} inão se encontra dentro da {range}.

source: {value!r} is not a valid boolean.
pt: {value!r} não é um bollean válido.

source: {value!r} is not a valid UUID.
pt: {value!r} não é um UUID válido.

source: file
pt: ficheiro

source: directory
pt: directório

source: path
pt: caminho

source: {name} {filename!r} does not exist.
pt: {name} {filename!r} não existe.

source: {name} {filename!r} is a file.
pt: {name} {filename!r} é um ficheiro.

source: {name} '{filename}' is a directory.
pt: {name} '{filename}' é um directório.

source: {name} {filename!r} is not readable.
pt: {name} {filename!r} não é legível.

source: {name} {filename!r} is not writable.
pt: {name} {filename!r} não é iterável.

source: {name} {filename!r} is not executable.
pt: {name} {filename!r} não é executável.
